perf/node_ping_proxy_v1.txt

> perf@1.0.0 artillery
> artillery

Phase started: eigth (index: 0, duration: 1s) 13:54:31(-0500)

Phase completed: eigth (index: 0, duration: 1s) 13:54:32(-0500)

Phase started: pause (index: 1, duration: 9s) 13:54:32(-0500)

Phase completed: pause (index: 1, duration: 9s) 13:54:41(-0500)

Phase started: ninth (index: 2, duration: 1s) 13:54:41(-0500)

Phase completed: ninth (index: 2, duration: 1s) 13:54:42(-0500)

Phase started: pause (index: 3, duration: 9s) 13:54:42(-0500)

--------------------------------------
Metrics for period to: 13:54:40(-0500) (width: 0.986s)
--------------------------------------

http.codes.200: ................................................................ 25
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 37
  median: ...................................................................... 0
  p95: ......................................................................... 3
  p99: ......................................................................... 13.1
http.responses: ................................................................ 25
vusers.completed: .............................................................. 25
vusers.created: ................................................................ 25
vusers.created_by_name.Root (/): ............................................... 25
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.5
  max: ......................................................................... 90.6
  median: ...................................................................... 10.9
  p95: ......................................................................... 37
  p99: ......................................................................... 67.4


Phase completed: pause (index: 3, duration: 9s) 13:54:51(-0500)

Phase started: tenth (index: 4, duration: 1s) 13:54:51(-0500)

Phase completed: tenth (index: 4, duration: 1s) 13:54:53(-0500)

Phase started: pause (index: 5, duration: 19s) 13:54:53(-0500)

--------------------------------------
Metrics for period to: 13:54:50(-0500) (width: 0.994s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  median: ...................................................................... 0
  p95: ......................................................................... 8.9
  p99: ......................................................................... 10.9
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Root (/): ............................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 57.5
  median: ...................................................................... 14.7
  p95: ......................................................................... 42.5
  p99: ......................................................................... 46.1


--------------------------------------
Metrics for period to: 13:55:00(-0500) (width: 2.062s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 98/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 44
  median: ...................................................................... 4
  p95: ......................................................................... 19.1
  p99: ......................................................................... 30.3
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Root (/): ............................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.2
  max: ......................................................................... 94.3
  median: ...................................................................... 32.1
  p95: ......................................................................... 58.6
  p99: ......................................................................... 67.4


Phase completed: pause (index: 5, duration: 19s) 13:55:12(-0500)

Phase started: first (index: 6, duration: 20s) 13:55:12(-0500)

--------------------------------------
Metrics for period to: 13:55:20(-0500) (width: 5.988s)
--------------------------------------

http.codes.200: ................................................................ 7
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 7
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 7
  median: ...................................................................... 0
  p95: ......................................................................... 0
  p99: ......................................................................... 0
http.responses: ................................................................ 7
vusers.completed: .............................................................. 7
vusers.created: ................................................................ 7
vusers.created_by_name.Root (/): ............................................... 7
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.7
  max: ......................................................................... 14.3
  median: ...................................................................... 4.5
  p95: ......................................................................... 12.6
  p99: ......................................................................... 12.6


Phase completed: first (index: 6, duration: 20s) 13:55:32(-0500)

Phase started: second (index: 7, duration: 10s) 13:55:32(-0500)

--------------------------------------
Metrics for period to: 13:55:30(-0500) (width: 9.011s)
--------------------------------------

http.codes.200: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 0
  median: ...................................................................... 0
  p95: ......................................................................... 0
  p99: ......................................................................... 0
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Root (/): ............................................... 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.5
  max: ......................................................................... 21.2
  median: ...................................................................... 2.6
  p95: ......................................................................... 10.9
  p99: ......................................................................... 10.9


Phase completed: second (index: 7, duration: 10s) 13:55:42(-0500)

Phase started: pause (index: 8, duration: 10s) 13:55:42(-0500)

--------------------------------------
Metrics for period to: 13:55:40(-0500) (width: 9.078s)
--------------------------------------

http.codes.200: ................................................................ 38
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 38
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 24
  median: ...................................................................... 0
  p95: ......................................................................... 4
  p99: ......................................................................... 16.9
http.responses: ................................................................ 38
vusers.completed: .............................................................. 38
vusers.created: ................................................................ 38
vusers.created_by_name.Root (/): ............................................... 38
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 25.8
  median: ...................................................................... 5.3
  p95: ......................................................................... 19.5
  p99: ......................................................................... 22


Phase completed: pause (index: 8, duration: 10s) 13:55:52(-0500)

Phase started: third (index: 9, duration: 10s) 13:55:52(-0500)

--------------------------------------
Metrics for period to: 13:55:50(-0500) (width: 2.823s)
--------------------------------------

http.codes.200: ................................................................ 15
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 15
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 1
http.responses: ................................................................ 15
vusers.completed: .............................................................. 15
vusers.created: ................................................................ 15
vusers.created_by_name.Root (/): ............................................... 15
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 57.8
  median: ...................................................................... 7.5
  p95: ......................................................................... 28.5
  p99: ......................................................................... 28.5


Phase completed: third (index: 9, duration: 10s) 13:56:02(-0500)

Phase started: pause (index: 10, duration: 10s) 13:56:02(-0500)

--------------------------------------
Metrics for period to: 13:56:00(-0500) (width: 7.095s)
--------------------------------------

http.codes.200: ................................................................ 177
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 178
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 27
  median: ...................................................................... 0
  p95: ......................................................................... 12.1
  p99: ......................................................................... 24.8
http.responses: ................................................................ 177
vusers.completed: .............................................................. 177
vusers.created: ................................................................ 178
vusers.created_by_name.Root (/): ............................................... 178
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.5
  max: ......................................................................... 78.4
  median: ...................................................................... 8.9
  p95: ......................................................................... 36.2
  p99: ......................................................................... 74.4


Phase completed: pause (index: 10, duration: 10s) 13:56:12(-0500)

Phase started: fourth (index: 11, duration: 10s) 13:56:12(-0500)

--------------------------------------
Metrics for period to: 13:56:10(-0500) (width: 2.896s)
--------------------------------------

http.codes.200: ................................................................ 73
http.request_rate: ............................................................. 26/sec
http.requests: ................................................................. 72
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 81
  median: ...................................................................... 0
  p95: ......................................................................... 1
  p99: ......................................................................... 10.1
http.responses: ................................................................ 73
vusers.completed: .............................................................. 73
vusers.created: ................................................................ 72
vusers.created_by_name.Root (/): ............................................... 72
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 102.5
  median: ...................................................................... 13.3
  p95: ......................................................................... 55.2
  p99: ......................................................................... 89.1


Phase completed: fourth (index: 11, duration: 10s) 13:56:22(-0500)

Phase started: pause (index: 12, duration: 10s) 13:56:22(-0500)

--------------------------------------
Metrics for period to: 13:56:20(-0500) (width: 7.029s)
--------------------------------------

http.codes.200: ................................................................ 351
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 352
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 45
  median: ...................................................................... 0
  p95: ......................................................................... 19.9
  p99: ......................................................................... 36.2
http.responses: ................................................................ 351
vusers.completed: .............................................................. 351
vusers.created: ................................................................ 352
vusers.created_by_name.Root (/): ............................................... 352
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.8
  max: ......................................................................... 97.6
  median: ...................................................................... 16.3
  p95: ......................................................................... 54.1
  p99: ......................................................................... 68.7


Phase completed: pause (index: 12, duration: 10s) 13:56:32(-0500)

Phase started: fifth (index: 13, duration: 10s) 13:56:32(-0500)

--------------------------------------
Metrics for period to: 13:56:30(-0500) (width: 2.885s)
--------------------------------------

http.codes.200: ................................................................ 149
http.request_rate: ............................................................. 52/sec
http.requests: ................................................................. 148
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 104
  median: ...................................................................... 1
  p95: ......................................................................... 34.1
  p99: ......................................................................... 100.5
http.responses: ................................................................ 149
vusers.completed: .............................................................. 149
vusers.created: ................................................................ 148
vusers.created_by_name.Root (/): ............................................... 148
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 138.9
  median: ...................................................................... 22.4
  p95: ......................................................................... 73
  p99: ......................................................................... 102.5


Phase completed: fifth (index: 13, duration: 10s) 13:56:43(-0500)

--------------------------------------
Metrics for period to: 13:56:40(-0500) (width: 7.108s)
--------------------------------------

http.codes.200: ................................................................ 662
http.request_rate: ............................................................. 94/sec
http.requests: ................................................................. 664
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 60
  median: ...................................................................... 3
  p95: ......................................................................... 23.8
  p99: ......................................................................... 37.7
http.responses: ................................................................ 662
vusers.completed: .............................................................. 662
vusers.created: ................................................................ 665
vusers.created_by_name.Root (/): ............................................... 665
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 157
  median: ...................................................................... 30.3
  p95: ......................................................................... 66
  p99: ......................................................................... 87.4


--------------------------------------
Metrics for period to: 13:56:50(-0500) (width: 3.861s)
--------------------------------------

http.codes.200: ................................................................ 338
http.request_rate: ............................................................. 87/sec
http.requests: ................................................................. 336
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 84
  median: ...................................................................... 5
  p95: ......................................................................... 22.9
  p99: ......................................................................... 40.9
http.responses: ................................................................ 338
vusers.completed: .............................................................. 338
vusers.created: ................................................................ 335
vusers.created_by_name.Root (/): ............................................... 335
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.9
  max: ......................................................................... 188.9
  median: ...................................................................... 36.2
  p95: ......................................................................... 73
  p99: ......................................................................... 98.5


All VUs finished. Total time: 2 minutes, 15 seconds

--------------------------------
Summary report @ 13:56:45(-0500)
--------------------------------

http.codes.200: ................................................................ 2095
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 2095
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 104
  median: ...................................................................... 2
  p95: ......................................................................... 22
  p99: ......................................................................... 40
http.responses: ................................................................ 2095
vusers.completed: .............................................................. 2095
vusers.created: ................................................................ 2095
vusers.created_by_name.Root (/): ............................................... 2095
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 188.9
  median: ...................................................................... 24.8
  p95: ......................................................................... 64.7
  p99: ......................................................................... 89.1